
/* dictionaries */
const indeclinable = ["метро", "пальто", "кенгуру", "зебу", "колибри", "сулугуни", "драже", "трюмо", "каноэ", "алоэ", "шасси", "такси", "жалюзи", "бра", "жюри", "рагу", "кино", "кофе", "радио", "шоссе"];

const partsOfEnding = ["а", "и", "й", "е", "ё", "о", "у", "ы", "э", "ю", "я", "ь"]; //глассные буквы + "й", "ь"
const vowels = ["а", "и", "е", "ё", "о", "у", "ы", "э", "ю", "я"]; //глассные буквы

const months = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]; //названия месяцов

const maleEnding = ["арь", "тель"]; //мужские окончания с "ь"
const femaleEnding = ["чь", "щь", "шь", "ость", "бь", "вь", "дь", "зь", "сь", "ть"]; //женские окончания с "ь"

const exceptionsOfTheGenus = ["шампунь", "автомобиль", "стиль", "уголь", "голубь", "лебедь", "шмель", "дождь", "гвоздь", "смерчь", "гость", "камень", "олень", "конь", "ячмень", "путь", "пароль", "парень", "зверь", "шкворень", "пень", "пельмень", "тюлень"]; //исключения с "ь"

const differing = ["бремя", "вымя", "темя", "пламя", "стремя", "пламя", "время", "знамя", "имя", "племя", "семя", "путь", "дитя"];
